balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
      <edc:DCRDef edc:access="------nn" edc:cname="CONFIG6L" edc:default="0x3" edc:desc="" edc:impl="0x3" edc:name="CONFIG6L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRT0" edc:desc="Write Protection bit Block 0 (000800-000FFF)" edc:mask="0x1" edc:name="WRT0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT1" edc:desc="Write Protection bit Block 1 (001000-001FFF)" edc:mask="0x1" edc:name="WRT1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn-----" edc:cname="CONFIG6H" edc:default="0xe0" edc:desc="" edc:impl="0xe0" edc:name="CONFIG6H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Write Protection bit (Configuration Registers)" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers are not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers are write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Write Protection bit (Boot Block Memory Area)" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Write Protection bit (Data EEPROM)" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="------nn" edc:cname="CONFIG7L" edc:default="0x3" edc:desc="" edc:impl="0x3" edc:name="CONFIG7L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EBTR0" edc:desc="Table Read Protection bit Block 0 (000800-000FFF)" edc:mask="0x1" edc:name="EBTR0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 is not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 is protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR1" edc:desc="Table Read Protection bit Block 1 (001000-001FFF)" edc:mask="0x1" edc:name="EBTR1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 is not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 is protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-n------" edc:cname="CONFIG7H" edc:default="0x40" edc:desc="" edc:impl="0x40" edc:name="CONFIG7H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x40">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="EBTRB" edc:desc="Table Read Protection bit (Boot Block Memory Area)" edc:mask="0x1" edc:name="EBTRB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block is not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block is protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0x1e20">
      <edc:DEVIDToRev edc:revlist="rev a" edc:value="0x1e20"/>
      <edc:DEVIDToRev edc:revlist="rev b0" edc:value="0x1e22"/>
    </edc:DeviceIDSector>
    <edc:EEDataSector edc:beginaddr="0xf00000" edc:endaddr="0xf00080" edc:regionid="eedata"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x80" edc:endaddr="0x100" edc:regionid="gpr0"/>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf80" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="nnrnnnnn" edc:cname="PORTA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTA" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0xff" edc:name="RA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN0" edc:desc="" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN1" edc:desc="" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX" edc:desc="" edc:mask="0x1" edc:name="TX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX" edc:desc="" edc:mask="0x1" edc:name="RX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN2" edc:desc="" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MCLR" edc:desc="" edc:mask="0x1" edc:name="MCLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSC2" edc:desc="" edc:mask="0x1" edc:name="OSC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSC1" edc:desc="" edc:mask="0x1" edc:name="OSC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="" edc:mask="0x1" edc:name="INT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1" edc:desc="" edc:mask="0x1" edc:name="INT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CK" edc:desc="" edc:mask="0x1" edc:name="CK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x1" edc:name="DT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKI" edc:desc="" edc:mask="0x1" edc:name="T0CKI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLKO" edc:desc="" edc:mask="0x1" edc:name="CLKO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKI" edc:desc="" edc:mask="0x1" edc:name="CLKI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="KBI0" edc:desc="" edc:mask="0x1" edc:name="KBI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="KBI1" edc:desc="" edc:mask="0x1" edc:name="KBI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="VREFP" edc:desc="" edc:mask="0x1" edc:name="VREFP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1OSO" edc:desc="" edc:mask="0x1" edc:name="T1OSO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1OSI" edc:desc="" edc:mask="0x1" edc:name="T1OSI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CMP0" edc:desc="" edc:mask="0x1" edc:name="CMP0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="nMCLR" edc:desc="" edc:mask="0x1" edc:name="nMCLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN3" edc:desc="" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="T1CKI" edc:desc="" edc:mask="0x1" edc:name="T1CKI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
