balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTB" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xff" edc:name="RB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM0" edc:desc="" edc:mask="0x1" edc:name="PWM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1" edc:desc="" edc:mask="0x1" edc:name="PWM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2" edc:desc="" edc:mask="0x1" edc:name="INT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT3" edc:desc="" edc:mask="0x1" edc:name="INT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2" edc:desc="" edc:mask="0x1" edc:name="PWM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3" edc:desc="" edc:mask="0x1" edc:name="PWM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM4" edc:desc="" edc:mask="0x1" edc:name="PWM4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM5" edc:desc="" edc:mask="0x1" edc:name="PWM5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="KBI2" edc:desc="" edc:mask="0x1" edc:name="KBI2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="KBI3" edc:desc="" edc:mask="0x1" edc:name="KBI3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PGC" edc:desc="" edc:mask="0x1" edc:name="PGC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PGD" edc:desc="" edc:mask="0x1" edc:name="PGD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CMP2" edc:desc="" edc:mask="0x1" edc:name="CMP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1" edc:desc="" edc:mask="0x1" edc:name="CMP1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T1OSO" edc:desc="" edc:mask="0x1" edc:name="T1OSO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1OSI" edc:desc="" edc:mask="0x1" edc:name="T1OSI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T1CKI" edc:desc="" edc:mask="0x1" edc:name="T1CKI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OVDCONS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="OVDCONS" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT" edc:desc="" edc:mask="0x3f" edc:name="POUT" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="POUT0" edc:desc="" edc:mask="0x1" edc:name="POUT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1" edc:desc="" edc:mask="0x1" edc:name="POUT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2" edc:desc="" edc:mask="0x1" edc:name="POUT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3" edc:desc="" edc:mask="0x1" edc:name="POUT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT4" edc:desc="" edc:mask="0x1" edc:name="POUT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT5" edc:desc="" edc:mask="0x1" edc:name="POUT5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="OVDCOND" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="OVDCOND" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POVD" edc:desc="" edc:mask="0x3f" edc:name="POVD" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="POVD0" edc:desc="" edc:mask="0x1" edc:name="POVD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1" edc:desc="" edc:mask="0x1" edc:name="POVD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2" edc:desc="" edc:mask="0x1" edc:name="POVD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3" edc:desc="" edc:mask="0x1" edc:name="POVD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD4" edc:desc="" edc:mask="0x1" edc:name="POVD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD5" edc:desc="" edc:mask="0x1" edc:name="POVD5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DTCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DTCON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DT0" edc:desc="" edc:mask="0x1" edc:name="DT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT1" edc:desc="" edc:mask="0x1" edc:name="DT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT2" edc:desc="" edc:mask="0x1" edc:name="DT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT3" edc:desc="" edc:mask="0x1" edc:name="DT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT4" edc:desc="" edc:mask="0x1" edc:name="DT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT5" edc:desc="" edc:mask="0x1" edc:name="DT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTPS0" edc:desc="" edc:mask="0x1" edc:name="DTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTPS1" edc:desc="" edc:mask="0x1" edc:name="DTPS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="PWMCON1" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="PWMCON1" edc:nzwidth="0x8" edc:por="00000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SEVTDIR" edc:desc="" edc:mask="0x1" edc:name="SEVTDIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="PWMCON0" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-000" edc:name="PWMCON0" edc:nzwidth="0x8" edc:por="-100-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMOD" edc:desc="" edc:mask="0x7" edc:name="PMOD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWMEN" edc:desc="" edc:mask="0x7" edc:name="PWMEN" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMOD0" edc:desc="" edc:mask="0x1" edc:name="PMOD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD2" edc:desc="" edc:mask="0x1" edc:name="PMOD2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWMEN0" edc:desc="" edc:mask="0x1" edc:name="PWMEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMEN1" edc:desc="" edc:mask="0x1" edc:name="PWMEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMEN2" edc:desc="" edc:mask="0x1" edc:name="PWMEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SEVTCMPH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SEVTCMPH" edc:nzwidth="0x8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTCMPH" edc:desc="" edc:mask="0xf" edc:name="SEVTCMPH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
