balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SEVTCMPL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SEVTCMPL" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTCMPL" edc:desc="" edc:mask="0xff" edc:name="SEVTCMPL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuxuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATA" edc:desc="" edc:mask="0xff" edc:name="LATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATB" edc:desc="" edc:mask="0xff" edc:name="LATB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="FLTCONFIG" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="FLTCONFIG" edc:nzwidth="0x8" edc:por="0----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTAEN" edc:desc="" edc:mask="0x1" edc:name="FLTAEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTAMOD" edc:desc="" edc:mask="0x1" edc:name="FLTAMOD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTAS" edc:desc="" edc:mask="0x1" edc:name="FLTAS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="BRFEN" edc:desc="" edc:mask="0x1" edc:name="BRFEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PDC2H" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PDC2H" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC2H" edc:desc="" edc:mask="0x3f" edc:name="PDC2H" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PDC2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PDC2L" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC2L" edc:desc="" edc:mask="0xff" edc:name="PDC2L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PDC1H" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PDC1H" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC1H" edc:desc="" edc:mask="0x3f" edc:name="PDC1H" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PDC1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PDC1L" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC1L" edc:desc="" edc:mask="0xff" edc:name="PDC1L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PDC0H" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PDC0H" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC0H" edc:desc="" edc:mask="0x3f" edc:name="PDC0H" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PDC0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PDC0L" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PDC0L" edc:desc="" edc:mask="0xff" edc:name="PDC0L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11x11111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="11x11111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xff" edc:name="TRISA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISB" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRB"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xff" edc:name="TRISB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PTPERH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="PTPERH" edc:nzwidth="0x8" edc:por="----1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTPERH" edc:desc="" edc:mask="0xf" edc:name="PTPERH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PTPERL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PTPERL" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTPERL" edc:desc="" edc:mask="0xff" edc:name="PTPERL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PTMRH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PTMRH" edc:nzwidth="0x8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMRH" edc:desc="" edc:mask="0xf" edc:name="PTMRH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
