balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PTMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PTMRL" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMRL" edc:desc="" edc:mask="0xff" edc:name="PTMRL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="PTCON1" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------" edc:name="PTCON1" edc:nzwidth="0x8" edc:por="00------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="PTDIR" edc:desc="" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PTCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PTCON0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMOD" edc:desc="" edc:mask="0x3" edc:name="PTMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTCKPS" edc:desc="" edc:mask="0x3" edc:name="PTCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTOPS" edc:desc="" edc:mask="0xf" edc:name="PTOPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PTMOD0" edc:desc="" edc:mask="0x1" edc:name="PTMOD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS0" edc:desc="" edc:mask="0x1" edc:name="PTCKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS1" edc:desc="" edc:mask="0x1" edc:name="PTCKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTOPS0" edc:desc="" edc:mask="0x1" edc:name="PTOPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTOPS1" edc:desc="" edc:mask="0x1" edc:name="PTOPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTOPS2" edc:desc="" edc:mask="0x1" edc:name="PTOPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTOPS3" edc:desc="" edc:mask="0x1" edc:name="PTOPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="OSCTUNE" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x1f" edc:name="TUN" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLEN" edc:desc="" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTSRC" edc:desc="" edc:mask="0x1" edc:name="INTSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP0IE" edc:desc="" edc:mask="0x1" edc:name="CMP0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1IE" edc:desc="" edc:mask="0x1" edc:name="CMP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2IE" edc:desc="" edc:mask="0x1" edc:name="CMP2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:desc="" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="PIR1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:desc="" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP0IF" edc:desc="" edc:mask="0x1" edc:name="CMP0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIF" edc:desc="" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIF" edc:desc="" edc:mask="0x1" edc:name="RCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="IPR1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01111111" edc:name="IPR1" edc:nzwidth="0x8" edc:por="01111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:desc="" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP0IP" edc:desc="" edc:mask="0x1" edc:name="CMP0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1IP" edc:desc="" edc:mask="0x1" edc:name="CMP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2IP" edc:desc="" edc:mask="0x1" edc:name="CMP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIP" edc:desc="" edc:mask="0x1" edc:name="TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIP" edc:desc="" edc:mask="0x1" edc:name="RCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIP" edc:desc="" edc:mask="0x1" edc:name="ADIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nn-" edc:cname="PIE2" edc:desc="" edc:impl="0x96" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-00-" edc:name="PIE2" edc:nzwidth="0x8" edc:por="0--0-00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LVDIE" edc:desc="" edc:mask="0x1" edc:name="LVDIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIE" edc:desc="" edc:mask="0x1" edc:name="EEIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OSCFIE" edc:desc="" edc:mask="0x1" edc:name="OSCFIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-nn-" edc:cname="PIR2" edc:desc="" edc:impl="0x96" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0-00-" edc:name="PIR2" edc:nzwidth="0x8" edc:por="0--0-00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LVDIF" edc:desc="" edc:mask="0x1" edc:name="LVDIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIF" edc:desc="" edc:mask="0x1" edc:name="EEIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OSCFIF" edc:desc="" edc:mask="0x1" edc:name="OSCFIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--n-n--" edc:cname="IPR2" edc:desc="" edc:impl="0x94" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1--1-1--" edc:name="IPR2" edc:nzwidth="0x8" edc:por="1--1-1--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LVDIP" edc:desc="" edc:mask="0x1" edc:name="LVDIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIP" edc:desc="" edc:mask="0x1" edc:name="EEIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OSCFIP" edc:desc="" edc:mask="0x1" edc:name="OSCFIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
