balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRGH" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRGH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRGH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="CMCON" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CMCON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMEN" edc:desc="" edc:mask="0x7" edc:name="CMEN" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C0OUT" edc:desc="" edc:mask="0x1" edc:name="C0OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CMEN0" edc:desc="" edc:mask="0x1" edc:name="CMEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMEN1" edc:desc="" edc:mask="0x1" edc:name="CMEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMEN2" edc:desc="" edc:mask="0x1" edc:name="CMEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="CVRCON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-111111" edc:name="CVRCON" edc:nzwidth="0x8" edc:por="1-111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CVR" edc:desc="" edc:mask="0xf" edc:name="CVR" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CVRSS" edc:desc="" edc:mask="0x1" edc:name="CVRSS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVRR" edc:desc="" edc:mask="0x1" edc:name="CVRR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CVREN" edc:desc="" edc:mask="0x1" edc:name="CVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CVR0" edc:desc="" edc:mask="0x1" edc:name="CVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR1" edc:desc="" edc:mask="0x1" edc:name="CVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR2" edc:desc="" edc:mask="0x1" edc:name="CVR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR3" edc:desc="" edc:mask="0x1" edc:name="CVR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVREF" edc:desc="" edc:mask="0x1" edc:name="CVREF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nrnnn-nn" edc:cname="BAUDCON" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000-00" edc:name="BAUDCON" edc:nzwidth="0x8" edc:por="01000-00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCKP" edc:desc="" edc:mask="0x1" edc:name="TXCKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXDTP" edc:desc="" edc:mask="0x1" edc:name="RXDTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCMT" edc:desc="" edc:mask="0x1" edc:name="RCMT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="7"/>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="ADCON2" edc:nzwidth="0x8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ACQT" edc:desc="" edc:mask="0x7" edc:name="ACQT" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT0" edc:desc="" edc:mask="0x1" edc:name="ACQT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT1" edc:desc="" edc:mask="0x1" edc:name="ACQT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACQT2" edc:desc="" edc:mask="0x1" edc:name="ACQT2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADCON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG" edc:desc="" edc:mask="0xf" edc:name="PCFG" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x1" edc:name="VCFG" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VCFG0" edc:desc="" edc:mask="0x1" edc:name="VCFG0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="ADCON0" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="0---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO/nDONE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3" edc:name="CHS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SEVTEN" edc:desc="" edc:mask="0x1" edc:name="SEVTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3" edc:name="CHS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SEVTEN" edc:desc="" edc:mask="0x1" edc:name="SEVTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DONE" edc:desc="" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="nDONE" edc:desc="" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_DONE" edc:desc="" edc:mask="0x1" edc:name="GO_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
