balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F1330.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TBLPTRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TBLPTRH" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TBLPTRH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TBLPTRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="TBLPTRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TBLPTRU" edc:nzwidth="0x8" edc:por="--000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TBLPTRU" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="TBLPTRU" edc:nzwidth="0x5"/>
                <edc:SFRFieldDef edc:cname="ACSS" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="ACSS" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PCLAT" edc:desc="" edc:name="PCLAT" edc:nzwidth="0x18">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLAT" edc:desc="" edc:mask="0x1fffff" edc:name="PCLAT" edc:nzwidth="0x15"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PCL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCLATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCLATH" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PCH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="PCLATU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PCLATU" edc:nzwidth="0x8" edc:por="---00000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCU" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="PCU" edc:nzwidth="0x5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="cc-nnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="STKPTR" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0x1f" edc:name="STKPTR" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STKUNF" edc:desc="" edc:mask="0x1" edc:name="STKUNF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKFUL" edc:desc="" edc:mask="0x1" edc:name="STKFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SP0" edc:desc="" edc:mask="0x1" edc:name="SP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP1" edc:desc="" edc:mask="0x1" edc:name="SP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP2" edc:desc="" edc:mask="0x1" edc:name="SP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP3" edc:desc="" edc:mask="0x1" edc:name="SP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP4" edc:desc="" edc:mask="0x1" edc:name="SP4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STKOVF" edc:desc="" edc:mask="0x1" edc:name="STKOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TOS" edc:desc="" edc:name="TOS" edc:nzwidth="0x18">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOS" edc:desc="" edc:mask="0x1fffff" edc:name="TOS" edc:nzwidth="0x15"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="TOSL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="TOSH" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TOSH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="TOSU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="---00000" edc:name="TOSU" edc:nzwidth="0x8" edc:por="---00000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TOSU" edc:desc="" edc:islanghidden="true" edc:mask="0x1f" edc:name="TOSU" edc:nzwidth="0x5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:NMMRPlace edc:regionid="peripheralnmmrs">
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR0_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR0_Internal" edc:nmmrid="0xA" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0_Prescale" edc:nmmrid="0x12" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR1_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR1_Internal" edc:nmmrid="0xC" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1_Prescale" edc:nmmrid="0x13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xfa6" edc:endaddr="0xfc2" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x80" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x60" edc:regionid="gpre"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x60" edc:endaddr="0x80" edc:regionid="accessram"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="KBI0"/>
      <edc:VirtualPin edc:name="CMP0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="KBI1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="FLTA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="Vss"/>
      <edc:VirtualPin edc:name="Avss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="TX"/>
      <edc:VirtualPin edc:name="CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="RX"/>
      <edc:VirtualPin edc:name="DT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="PWM2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="PWM3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="PWM4"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="PWM5"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="Vdd"/>
      <edc:VirtualPin edc:name="Avdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="AN3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="FLTA"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="KBI2"/>
      <edc:VirtualPin edc:name="CMP2"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="KBI3"/>
      <edc:VirtualPin edc:name="CMP1"/>
      <edc:VirtualPin edc:name="T1OSI"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>